Update readme diagram to use mermaid format
